#include <stdio.h>//预处理，程序运行之前，需要做的事情
//主入口
int main(){//输出语句，小括号李面表示输出的内容
    printf("Hello World!\n");
    return 0;//return表示程序结束，0表示正常结束，非0表示异常结束，这里的0要和上面的int呼应起来
}//ctrl+K,ctrl+C快捷注释键
/*取消快捷键ctrl+K,ctrl+U,注释不参与运行，同一注释类型不能有嵌套的同一注释*/
//程序是为了处理数据的
/*c语言核心语法：
*关键字：一特征1字母全部小写，2一般针对关键字有特殊的颜色标记，非常直观
*常量：类型：整型常量：整数 12+13计算
            实型常量：有小数点的数字
            字符常量：单引号引起来的字母，数字，英文符号，转义字符，只能写一个
            字符串常量：双引号引起来的字符序列 12+13展示
                特殊用法：实型常量：.93=0.93 18.=18.0 
                        科学计数法表示的数字:1.230000*10^7是一个计算过程，1.2340000E7是实型常量
        定义：在程序运行中，其值不发生改变  
        输出常量：printf(参数1，参数2) 参数1必填：输出内容的最终样式以字符串的形式体现，必须用字符串，字符串里可以有占位符；参数2选填：填补的内容，参数2是常量和变量，变量不用加引号，常量看类型
                格式控制符(占位符)：整型%d，占位符相当于占据一个位置，用后面的参数2的内容填补这个位置，最终输出的内容是参数1和参数2的结合
                                  实型%f
                                  字符%c
                                  字符串%s
        拓展：//练习输出多个变量：printf("亲亲女朋友的姓名是：%s。性别：%s。年龄：%d岁","小红"，"女"，20)             
                   输出换行：换行符windows系统下\n，linux系统下\n，mac系统下\r\n \r表示回到行首，\n表示换行，\r\n表示回车换行
*变量：理解: 变量是储存数据的容器，不是里面的数据   
       定义格式：数据类型，变量名 "int a;""
                        # 数据类型：为盒子中储存的数据，加入类型限制 such as :int, float, double, char等 
                        #变量名：为盒子起的名字
        变量的使用：细节：先定义再赋值；int a;,a=10，或者两个步骤合并
                    1，赋值/修改值                
                 在项目中如何使用变量：经常改变的数据我们可以用变量来表示            
        变量的注意事项：1.只能存一个值
                       2.变量名不能重复 错误案例：int a=10;int a=20; 正确案例：int a=10;int b=20;
                       3.一条语句可以定义多个变量(了解) example：int a=10,b=20,c=30
                       4.变量在使用前一定要赋值
                       5.变量的作用域范围
*计算机的存储规则：在计算机中，任意数据都是以二进制形式储存的
        二进制：0和1组成的数制系统，逢二进一，借一当二 1+1=10   
        低电压0高电压1
        文本{数字.字母.汉字}，图片{像素.RGB}，声音的存储：#数字直接转二进制；#字母，英文字符：ASCII码表；汉字：Unicode码表，GBK编码；#图片：1.分辨率：方格的总数，像素：方格；三原色：光学三原色（计算机）红绿蓝RGB0~255#声音：收音形成波形图，然后采样（记录当前的音频数据）
        常见的进制：二进制、八进制、十进制、十六进制
        八进制：0~7,每三个二进制组成一个八进制数字，相当于缩短二进制数字的长度  逢八进一           
        十六进制0~9，A~F,四个二进制位组成一个十六进制数字，相当于缩短二进制数字的长度  逢十六进一                                                                                                                                                                             采样频率，最终形成采样波形图  ，
        代码中的书写：二进制：由0.1构成，代码中以0b或0B开头；八进制：由0开头；十六进制：由0x或0X开头；ATTENTION:注意语法错误
        进制转换：1：任意进制转十进制，公式：系数*基数的权次幂相加；系数：就是每一位上的数字，基数：当前制数；权：从右往左，依次为012345······
                 2：二进制转十进制：128 64 32 16 8 4 2 1         
                                    1  1  1  1  1 1 1 1  
                 3：十进制转二进制：除基取余法：不断地除以基数（进制）得到余数，直到商为0，再将余数逆序排列                  
                            
*核心语法2-数据类型：作用：1.变量中能存储什么类型的数据2.决定储存空间的大小                 
                   单位：一个0或1的二进制位称为一个比特位（bit）（计算机中最小的存储单元），8个比特位组成一个字节byte，1byte=8bit 举例：一个int 32位（bit） 4个字节（byte）
                   类型：1.整数（short int（一般都用int） long (longlong）此为c99标准)  c语言中整数一般为int类型
                               short简短型 2B，long 类型 长整型 4个字节（windows），long long(c99) 超长整型 windows 8个字节（19位数），利用sizeof测量每一种数据类型占用对少字节,sizeof(变量名/数据类型)
                               注意事项：long x =100L 输出变量的值之前%d变为%ld
                                        long long x =100LL 输出变量之前%d变为lld

                                        printf("%zu\n",sizeof());
                                        除int外
                                        其他的数据类型自动省略int 如short=short int
                                    有符号整数，无符号整数的定义情况：signed有符号整数 正数 负数 //unsigned无符号整数 正数   举例：unsigned int unsigned short  注意对应的输出也要改变printf（"%u",变量名），对应的变量类型的范围也会被扩大，扩大至原有范围上下限绝对值之和


                                
                  
                 
                 
                 */           